const questions = [
    {
        id: 1, 
        title: 'Что такое хуки в React?',
        info: 'Хуки — нововведение в React 16.8, которое позволяет использовать состояние и другие возможности React без написания классов. Хуки — это функции, с помощью которых вы можете «подцепиться» к состоянию и методам жизненного цикла React из функциональных компонентов. Хуки не работают внутри классов — они дают вам возможность использовать React без классов.',
    },
    {
        id: 2, 
        title: 'Для чего используется WebSocket? В чем принцип его работы?',
        info: 'Протокол WebSocket («веб-сокет»), описанный в спецификации RFC 6455, обеспечивает возможность обмена данными между браузером и сервером через постоянное соединение. Данные передаются по нему в обоих направлениях в виде «пакетов», без разрыва соединения и дополнительных HTTP-запросов.',
    },
    {
        id: 3, 
        title: 'Объясните, что такое файлы cookie в JavaScript',
        info: 'Ответ: Cookies – это небольшие текстовые файлы, которые хранятся на компьютере и создаются, когда пользователь заходит на веб-сайты. Например, это могут быть сведения о пользователе или информация о содержимом корзины покупок из прошлых посещений.',
    },
    {
        id: 4, 
        title: 'Для чего используются операторы break и continue в JavaScript?',
        info: 'Ответ: Оператор break выходит из запущенного цикла в то время как, оператор continue продолжает работу после прерывания всего одной итерации. Оба оператора позволяют написать сложную циклическую функцию с различными результатами и требуемыми действиями на основе заданного результата функции.',
    },
    {
        id: 5, 
        title: 'NaN и его роль в языке',
        info: 'Когда значение в операции не число, оно возвращает NaN. Это может произойти в нескольких случаях. Например, если операция возвращает неподходящий результат, потому что часть функции была нечисловой или результат имеет значение, не являющееся числовым.',
    }
]
export default questions;